/*************************************************************************
                           Test  -  description
                             -------------------
    début                : 2015/10/09
    copyright            : (C) 2015 par cespeute & brenault
*************************************************************************/

//---------- Interface de la classe <Test> (fichier ${file_name}) ------
#if ! defined ( TEST_H )
#define TEST_H

//--------------------------------------------------- Interfaces utilisées

//------------------------------------------------------------- Constantes 

//------------------------------------------------------------------ Types 

//------------------------------------------------------------------------ 
// Rôle de la classe <Test>
//
//
//------------------------------------------------------------------------ 

class Test
{
//----------------------------------------------------------------- PUBLIC

public:
//----------------------------------------------------- Méthodes publiques
    // type Méthode ( liste de paramètres );
    // Mode d'emploi :
    //
    // Contrat :
    //


//------------------------------------------------- Surcharge d'opérateurs


//-------------------------------------------- Constructeurs - destructeur
    Test ( const Test & unTest );
    // Mode d'emploi (constructeur de copie) :
    //
    // Contrat :
    //

    Test ( );
    // Mode d'emploi :
    //
    // Contrat :
    //

    virtual ~Test ( );
    // Mode d'emploi :
    //
    // Contrat :
    //

//------------------------------------------------------------------ PRIVE 

protected:
//----------------------------------------------------- Méthodes protégées

private:
//------------------------------------------------------- Méthodes privées

protected:
//----------------------------------------------------- Attributs protégés

private:
//------------------------------------------------------- Attributs privés


//---------------------------------------------------------- Classes amies

//-------------------------------------------------------- Classes privées
    Collection testCollection;
//----------------------------------------------------------- Types privés

};

//----------------------------------------- Types dépendants de <Test>

#endif // TEST_H
